Ran Plan for dir: `terraform-multitenancy/envs/eu-de/dev` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/home/atlantis/.atlantis/bin/terraform1.7.5 plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/opentelekomcloud-community/terraform-workshop/5/default/terraform-multitenancy/envs/eu-de/dev/multitenancy-dev-default.tfplan"' in '/home/atlantis/.atlantis/repos/opentelekomcloud-community/terraform-workshop/5/default/terraform-multitenancy/envs/eu-de/dev': exit status 1
module.packager.null_resource.build_function: Refreshing state... [id=9071456461591152008]
module.packager.data.archive_file.function_zip: Reading...
module.networking.opentelekomcloud_vpc_v1.vpc: Refreshing state... [id=c835ec22-ac2a-4a40-9c07-5e9e90052b4f]
data.opentelekomcloud_compute_availability_zones_v2.zones: Reading...
module.networking.opentelekomcloud_networking_secgroup_v2.apigw: Refreshing state... [id=e4d747ed-6f12-4e5b-aeac-e5d2278463ee]
module.packager.opentelekomcloud_obs_bucket.bucket: Refreshing state... [id=workshop-bucket]
module.function.opentelekomcloud_lts_group_v2.group: Refreshing state... [id=1f9ce181-29e7-4a8b-94a1-81edd43acffa]
module.networking.opentelekomcloud_vpc_subnet_v1.subnet: Refreshing state... [id=0c561875-13fb-4c7a-bb72-407baf44aa52]
module.networking.opentelekomcloud_networking_secgroup_rule_v2.rules["1"]: Refreshing state... [id=b0787297-f837-4647-96ff-aa3aae5c458e]
module.networking.opentelekomcloud_networking_secgroup_rule_v2.rules["0"]: Refreshing state... [id=ac357fb9-4298-42e9-bc4b-33c58252bcb2]
data.opentelekomcloud_compute_availability_zones_v2.zones: Read complete after 0s [id=3726637984]
module.apigw.opentelekomcloud_apigw_gateway_v2.gw: Refreshing state... [id=dac468b60d104438a7164323a75be477]
module.redis.opentelekomcloud_dcs_instance_v2.redis: Refreshing state... [id=6a78e11e-f821-4d73-bc6f-ed175b411d0f]
module.apigw.opentelekomcloud_apigw_group_v2.group: Refreshing state... [id=781550b8784a470e8cb755623c2756b6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apigw.opentelekomcloud_apigw_gateway_v2.gw has been deleted
  - resource "opentelekomcloud_apigw_gateway_v2" "gw" {
      - id                              = "dac468b60d104438a7164323a75be477" -> null
        name                            = "workshop-gw"
        # (20 unchanged attributes hidden)
    }

  # module.networking.opentelekomcloud_networking_secgroup_v2.apigw has been deleted
  - resource "opentelekomcloud_networking_secgroup_v2" "apigw" {
      - id          = "e4d747ed-6f12-4e5b-aeac-e5d2278463ee" -> null
        name        = "workshop-apigw-sg"
        # (3 unchanged attributes hidden)
    }

  # module.networking.opentelekomcloud_vpc_subnet_v1.subnet has been deleted
  - resource "opentelekomcloud_vpc_subnet_v1" "subnet" {
      - id            = "0c561875-13fb-4c7a-bb72-407baf44aa52" -> null
        name          = "workshop-fgs-subnet"
        # (12 unchanged attributes hidden)
    }

  # module.networking.opentelekomcloud_vpc_v1.vpc has been deleted
  - resource "opentelekomcloud_vpc_v1" "vpc" {
      - id     = "c835ec22-ac2a-4a40-9c07-5e9e90052b4f" -> null
        name   = "workshop-fgs-vpc"
        # (4 unchanged attributes hidden)
    }

  # module.redis.opentelekomcloud_dcs_instance_v2.redis has been deleted
  - resource "opentelekomcloud_dcs_instance_v2" "redis" {
      - id                           = "6a78e11e-f821-4d73-bc6f-ed175b411d0f" -> null
      - name                         = "workshop-redis" -> null
      - private_ip                   = "10.10.1.4" -> null
        # (33 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.apigw.opentelekomcloud_apigw_gateway_v2.gw will be created
  + resource "opentelekomcloud_apigw_gateway_v2" "gw" {
      + availability_zones              = [
          + "eu-de-01",
        ]
      + bandwidth_size                  = 5
      + default_group_id                = (known after apply)
      + description                     = "Dedicated gateway for workshop"
      + enterprise_project_id           = (known after apply)
      + id                              = (known after apply)
      + ingress_bandwidth_charging_mode = "bandwidth"
      + ingress_bandwidth_size          = 5
      + loadbalancer_provider           = "elb"
      + maintain_begin                  = (known after apply)
      + maintain_end                    = (known after apply)
      + name                            = "workshop-gw"
      + private_egress_addresses        = (known after apply)
      + project_id                      = (known after apply)
      + public_egress_address           = (known after apply)
      + region                          = (known after apply)
      + security_group_id               = (known after apply)
      + spec_id                         = "BASIC"
      + status                          = (known after apply)
      + subnet_id                       = (known after apply)
      + supported_features              = (known after apply)
      + vpc_id                          = (known after apply)
      + vpc_ingress_address             = (known after apply)
      + vpcep_service_name              = (known after apply)
    }

  # module.networking.opentelekomcloud_networking_secgroup_rule_v2.rules["0"] will be created
  + resource "opentelekomcloud_networking_secgroup_rule_v2" "rules" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 443
      + port_range_min    = 443
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.networking.opentelekomcloud_networking_secgroup_rule_v2.rules["1"] will be created
  + resource "opentelekomcloud_networking_secgroup_rule_v2" "rules" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 80
      + port_range_min    = 80
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.networking.opentelekomcloud_networking_secgroup_v2.apigw will be created
  + resource "opentelekomcloud_networking_secgroup_v2" "apigw" {
      + description = "Allow necessary ports from everywhere"
      + id          = (known after apply)
      + name        = "workshop-apigw-sg"
      + region      = (known after apply)
      + tenant_id   = (known after apply)
    }

  # module.networking.opentelekomcloud_vpc_subnet_v1.subnet will be created
  + resource "opentelekomcloud_vpc_subnet_v1" "subnet" {
      + availability_zone = (known after apply)
      + cidr              = "10.10.1.0/24"
      + cidr_ipv6         = (known after apply)
      + dhcp_enable       = true
      + dns_list          = (known after apply)
      + gateway_ip        = "10.10.1.1"
      + gateway_ipv6      = (known after apply)
      + id                = (known after apply)
      + name              = "workshop-fgs-subnet"
      + network_id        = (known after apply)
      + primary_dns       = (known after apply)
      + region            = (known after apply)
      + secondary_dns     = (known after apply)
      + status            = (known after apply)
      + subnet_id         = (known after apply)
      + vpc_id            = (known after apply)
    }

  # module.networking.opentelekomcloud_vpc_v1.vpc will be created
  + resource "opentelekomcloud_vpc_v1" "vpc" {
      + cidr   = "10.10.0.0/16"
      + id     = (known after apply)
      + name   = "workshop-fgs-vpc"
      + region = (known after apply)
      + shared = (known after apply)
      + status = (known after apply)
    }

  # module.redis.opentelekomcloud_dcs_instance_v2.redis will be created
  + resource "opentelekomcloud_dcs_instance_v2" "redis" {
      + access_user                  = (known after apply)
      + availability_zones           = [
          + "eu-de-01",
        ]
      + bandwidth_info               = (known after apply)
      + cache_mode                   = (known after apply)
      + capacity                     = 0.125
      + cpu_type                     = (known after apply)
      + created_at                   = (known after apply)
      + description                  = (known after apply)
      + domain_name                  = (known after apply)
      + enable_whitelist             = (known after apply)
      + engine                       = "Redis"
      + engine_version               = "6.0"
      + flavor                       = "redis.ha.xu1.tiny.r2.128"
      + id                           = (known after apply)
      + launched_at                  = (known after apply)
      + maintain_begin               = "02:00:00"
      + maintain_end                 = "06:00:00"
      + max_memory                   = (known after apply)
      + name                         = "workshop-redis"
      + password                     = (sensitive value)
      + port                         = (known after apply)
      + private_ip                   = (known after apply)
      + product_type                 = (known after apply)
      + readonly_domain_name         = (known after apply)
      + region                       = (known after apply)
      + replica_count                = (known after apply)
      + security_group_name          = (known after apply)
      + sharding_count               = (known after apply)
      + ssl_enable                   = (known after apply)
      + status                       = (known after apply)
      + subnet_cidr                  = (known after apply)
      + subnet_id                    = (known after apply)
      + subnet_name                  = (known after apply)
      + transparent_client_ip_enable = (known after apply)
      + used_memory                  = (known after apply)
      + user_id                      = (known after apply)
      + user_name                    = (known after apply)
      + vpc_id                       = (known after apply)
      + vpc_name                     = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
╷
│ Error: dedicated group: Bad request with: [GET https://apig.eu-de.otc.t-systems.com/v2/d11e011510434273a96fc831d777698b/apigw/instances/dac468b60d104438a7164323a75be477/api-groups/781550b8784a470e8cb755623c2756b6], error message: {"error_code":"APIG.1136","error_msg":"No permissions to perform operations on this instance"}
│ 
│   with module.apigw.opentelekomcloud_apigw_group_v2.group,
│   on ../../../modules/apigw/main.tf line 16, in resource "opentelekomcloud_apigw_group_v2" "group":
│   16: resource "opentelekomcloud_apigw_group_v2" "group" {
│ 
╵
╷
│ Error: unable to find OpenTelekomCloud LTS v2 log group by its ID (1f9ce181-29e7-4a8b-94a1-81edd43acffa): %!s(<nil>)
│ 
│   with module.function.opentelekomcloud_lts_group_v2.group,
│   on ../../../modules/function/main.tf line 31, in resource "opentelekomcloud_lts_group_v2" "group":
│   31: resource "opentelekomcloud_lts_group_v2" "group" {
│ 
╵
╷
│ Error: Archive creation error
│ 
│   with module.packager.data.archive_file.function_zip,
│   on ../../../modules/packager/main.tf line 44, in data "archive_file" "function_zip":
│   44: data "archive_file" "function_zip" {
│ 
│ error creating archive: error archiving directory: could not archive
│ missing directory:
│ /home/atlantis/.atlantis/repos/opentelekomcloud-community/terraform-workshop/5/default/terraform-multitenancy/envs/eu-de/dev/build/function_pkg
╵


```
</details>